app/controllers/comments_controller.rb

 def create
  @link = Link.find(params[:link_id])
  @comment = @link.comments.new(comment_params)
  @comment.user = current_user


  respond_to do |format|
    if @comment.save
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("link_id", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["link_id", 1], ["body", "This comment works =)"], ["user_id", 2], ["created_at", 2016-11-30 23:17:44 UTC], ["updated_at", 2016-11-30 23:17:44 UTC]]