app/controllers/links_controller.rb

  def index
    @links = Link.all
---
SELECT "links".* FROM "links"

  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "ESPN"], ["url", "http://espn.com"], ["created_at", 2016-11-30 13:49:00 UTC], ["updated_at", 2016-11-30 13:49:00 UTC], ["user_id", 1]]

  def update
    respond_to do |format|
      if @link.update(link_params)
---
UPDATE "links" SET "title" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["title", "Best Deals Ever Save lots of $$$!!!"], ["updated_at", 2016-12-01 21:38:56 UTC], ["id", 5]]

  def destroy
    @link.destroy
---
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 3]]

  def upvote
    @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def downvote
    @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_link
      @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]